Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །འཕང་དུ་དཔག་ཚད་ལྔ་པ་འབྱུང་བར་འགྱུར། །
en: The single relic of this victor will be contained in a stūpa That is five leagues tall.

source: འཇིག་རྟེན་མགོན་པོ་ལེགས་པར་གནས་པ་ཡི། །སྐྱེ་ཡུལ་ལེགས་པར་རབ་ཏུ་གནས་ཞེས་བྱ། །
en: “The protector of the world, Susthita, Will be born in a place called Excellent Abiding.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་དོན་གནས་ཡིན། །ཡོན་ཏན་ལྡན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: This victor will be of kṣatriya family, And his light will extend nine leagues. “Meaningful Abiding will be his father, and Endowed with Qualities will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐུ་བློ་མཐུ་རིམ་གྲོ་པ། །
en: Excellent Power will be his son and Mind Power his attendant.

source: དགེ་གནས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Virtuous Abiding will be the scholar

source: གཏི་མུག་མེད་པ་མཐའ་ཡས་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Absence of Ignorance the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་དག་ནི་ཚང་བར་འདུས་འགྱུར་ཏེ། །ཐེར་འབུམ་ཕྲག་ནི་དགུ་དགུ་འབྱུང་བར་འགྱུར། །
en: “There will be ninety consecutive congregations, Each of them gathering Nine billion worthy ones.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གཅིག་ཡིན། །
en: The lifespan of humans will be eleven thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་བརྒྱད་སྟོང་ཚང་བར་གནས། །
en: “And the sacred Dharma of the one who attained nirvāṇa Will remain for seventy-eight thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །གསེར་གྱི་རྒྱལ་མཚན་མཆོག་གིས་འཁོར་བར་གང་། །
en: The relics of this victor will be abundant And surrounded by supreme golden banners.

source: དེ་བཞིན་གཤེགས་པ་བློ་ནི་སྦྱངས་པ་ཡི། །སྐྱེ་ཡུལ་བསོད་ནམས་ལེགས་པར་བསགས་ཞེས་བྱ། །
en: “The thus-gone Cīrṇabuddhi Will be born in a place called Excellent Accumulation of Merit.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་སྣང་ལྡན་ཡིན། །བདེན་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: This victor will be of kṣatriya family, And his light will extend one hundred leagues. “Endowed with Light will be his father, and Possessor of Truth will be this victor’s mother.

source: སྲས་པོ་བློ་གྲོས་བློ་བཟངས་རིམ་གྲོ་པ། །འོད་ཟེར་ཆེན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Intelligence will be his son and Excellent Mind his attendant. Great Radiance will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པའི་འཆིང་བ་གཅོད་པར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བཅུ་བཅུ་འདུས་པར་འགྱུར། །
en: “There will be seventy consecutive congregations, Each of them gathering one hundred million Who cut through the ties of existence.

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this victor has attained nirvāṇa His sacred Dharma will remain for sixty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ལྷ་རྫས་རྒྱལ་མཚན་མཆོག་གིས་མཛེས་པར་བྱས། །
en: The relics of this victor will be abundant, Decorated with divine substances and supreme banners.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་སྐྱེ་བའི། །ཡུལ་ནི་སྒྲ་སྙན་པ་དག་གྲག་ཅེས་བྱ། །
en: “The thus-gone Brahmaghoṣa Will be born in a place called Beautiful Tones.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་ལྔ་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend twenty-five leagues. “Excellent Brahmā will be his father, and Brahmā Melody will be this victor’s mother.

source: སྲས་པོ་ཚངས་བྱིན་བརྟུལ་ཞུགས་རིམ་གྲོ་པ། །
en: Brahmā Gift will be his son and Yogic Discipline his attendant.

source: སྙིང་རྗེའི་མིག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Eye of Compassion will be the scholar

source: ཚངས་དབང་བདག་ཉིད་ཆེན་པོ་རྫུ་འཕྲུལ་ཅན། །
en: And Brahmā Lord Great Being the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །ཆགས་པ་ཞི་བའི་ཡིད་དང་ལྡན་དེ་དག །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་འབྱུང་བར་འགྱུར། །
en: “There will be five consecutive congregations, Each of them gathering ten billion Whose minds have pacified attachment.

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །ཉི་ཤུ་རྩ་བདུན་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this victor Will remain for twenty-seven thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་སུམ་ཅུ་པ་གཅིག་འབྱུང་བར་འགྱུར། །
en: The stūpa containing the relics of this victor Will be thirty leagues large.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཆོག་མ་ཡི། །སྐྱེ་ཡུལ་ལག་མཆོག་དག་གིས་བརྒྱན་ཞེས་བྱ། །
en: “The thus-gone Guṇottama Will be born in a place called Adorned with the Supreme.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡབ་ནི་ལག་མཆོག་ཡིན། །ཀླུ་འོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend twelve leagues. “Supreme Hand will be his father, and Nāga Light will be this victor’s mother.

source: སྲས་པོ་ལྔ་པ་གཉིད་སྤངས་རིམ་གྲོ་པ། །
en: Fifth will be his son and Giving Up Sleep his attendant.

source: གླུ་དབྱངས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Song will be the scholar

source: མགོན་པོ་མཐོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Protector Sight the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །དེར་ནི་ཐམས་ཅད་དག་ཀྱང་འདུས་འགྱུར་ཏེ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be twenty-two consecutive congregations, Each of them bringing together A gathering of two hundred twenty million.

source: མཚུངས་མེད་རྒྱལ་བ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་དྲུག་གནས། །
en: “And after this incomparable victor has attained nirvāṇa His sacred Dharma will remain for sixteen thousand years.

source: འཇིག་རྟེན་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །རྒྱས་པར་འགྱུར་ཞིང་འཕེལ་བ་དག་ཏུ་འགྱུར། །
en: For the benefit of the world the relics of this victor Will increase in abundance.

source: དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་དབྱངས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པའི་དབྱངས་ཞེས་བྱ། །
en: “The thus-gone Garjitasvara Will be born in a place called Melody of Fame.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་རྣམ་པར་གྲགས། །དབྱངས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Famed will be his father, and Supreme Melody will be this victor’s mother.

source: སྲས་པོ་སྐད་སྙན་ཡིད་འཐད་རིམ་གྲོ་པ། །
en: Beautiful Voice will be his son and Reasoning Mind his attendant.

source: དྲག་ཤུལ་སྐད་འབྱིན་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Fierce Voice the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པ་གསུམ་ལས་རྒལ་བའི་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་སུམ་ཅུ་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering three hundred million Whose minds have gone beyond the three worlds.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཅུ་བདུན་དག་གི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will remain For seventeen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་གསེར་རྒྱན་རྣམ་པར་སྦྱངས། །
en: The relics of this victor will be contained In a stūpa five leagues large and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་མངོན་པར་ཤེས་ཏོག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱ། །
en: “The thus-gone Abhijñāketu Will be born in a place called Radiant Crest.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཞི་ཡོད་མངོན་པར་ཤེས་པ་ཡབ། །ཡོན་ཏན་མངོན་ཤེས་རྡུལ་བྲལ་ཡུམ་ཡིན་སྲས། །མངོན་ཤེས་རྫུ་འཕྲུལ་བཟང་པོ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend four leagues. “Superknowledge will be his father, and Qualities of Superknowledge will be this immaculate one’s mother. Superknowledge will be his son and Excellent Miraculous Ability his attendant.

source: སྨོན་ལམ་ཞེས་བྱ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Aspiration will be the one of intelligence

source: གཞུང་ལ་རྣམ་པར་བསྒོམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Cultivating the Scriptures the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །སློབ་པ་མེད་པར་ཕྱིན་པ་ཀུན་འདུ་སྟེ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eight consecutive congregations, Each of them gathering seven hundred thirty million Who have gone to the stage of no more training.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དྲུག་ཁྲིའི་བར་དུ་གནས། །
en: “And when this victor has attained nirvāṇa His sacred Dharma will remain for sixty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་གསེར་གྱི་བླ་རེར་ལྡན། །
en: The relics of this victor will be contained In a stūpa four leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་ཏོག་གི་འོད་སྐྱེ་བའི། །ཡུལ་ནི་བསོད་ནམས་ཕུང་པོ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Ketuprabha Will be born in a place called Heap of Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཕུང་པོ་བཟང་། །ཡོན་ཏན་མེ་ཏོག་རྡུལ་དང་བྲལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Excellent Heap will be his father, and Flower of Qualities will be this victor’s mother.

source: ཕུང་པོ་སྲས་ཡིན་རི་རབ་རིམ་གྲོ་པ། །
en: Heap will be his son and Best of Mountains his attendant.

source: བྱང་ཆུབ་དག་ལ་གཞོལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Merging with Awakening the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་རྩ་ལྔ་སྟེ། །ཀུན་ལའང་ཐར་པ་ཐོབ་པར་འགྱུར་བ་དག །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་བརྒྱད་ཅུ་ཡོད། །
en: “There will be twenty-five consecutive congregations, Each of them gathering eight hundred million Who all have attained liberation.

source: དམ་པའི་ཆོས་ནི་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །ཉི་ཤུ་རྩ་གཉིས་བར་དུ་གནས་པར་འགྱུར། །
en: “And his sacred Dharma will remain For twenty-two thousand years.

source: འཇིག་རྟེན་ཕན་པའི་ཕྱིར་ནི་རྒྱལ་བ་དེའི། །སྐུ་གདུང་དག་ནི་རྣམ་པར་རྒྱས་པར་འགྱུར། །
en: For the benefit of the world The relics of this victor will be abundant.

source: དེ་བཞིན་གཤེགས་པ་མི་འདྲེན་དགེ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགེ་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Kṣema Will be born in a place called Endowed with Virtue.

source: དེ་ཡི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་སྟོང་ཤིན་ཏུ་དགེ་བ་ཡབ། །དགེ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend three thousand leagues. “Extremely Virtuous will be his father, and Supreme Virtue will be this victor’s mother.

source: སྲས་པོ་དགེ་བ་དགེ་བྱིན་རིམ་གྲོ་པ། །
en: Virtue will be his son and Virtue Gift his attendant.

source: འཇིག་རྟེན་དད་པར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Instiller of Faith in the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སངས་རྒྱས་ཡོན་ཏན་ལྡན་པ་ཕྱིར་མི་ལྡོག །དེ་དག་དགུ་འབུམ་དགུ་འབུམ་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred thousand Who have become irreversible in their attainment of buddha qualities.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་བདུན་ཅུ་དྲུག །
en: The lifespan of humans will be seven hundred sixty million years,

source: གྲགས་པ་མཐའ་ཡས་དག་གི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་འབུམ་ཉི་ཁྲིའི་བར་དུ་གནས། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain nine hundred twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །ཁམས་གསུམ་ཀུན་ཏུ་རྣམ་པར་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, Filling all of the three realms.

source: འཇིག་རྟེན་མགོན་པོ་ཚངས་པ་སྐྱེ་བའི་ཡུལ། །དགའ་ཞིང་སྡུག་ལ་ཚངས་པ་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world Brahmā Will be born in a place called Brahmā in Joy and Delight.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཚངས་པའི་དཔང་པོ་ཡབ། །ཚངས་དབྱངས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy leagues. “Brahmā Lord will be his father, and Brahmā Melody will be this victor’s mother.

source: སྲས་པོ་སྐད་སྙན་དན་མཆོག་རིམ་གྲོ་པ། །
en: Beautiful Voice will be his son and Sacred Dharma his attendant.

source: ཚངས་པའི་གྲོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Brahmā Friend will be the scholar

source: འདུས་པ་ལན་ཅིག་ཡིན་ཏེ་དགྲ་བཅོམ་པ། །ཐམས་ཅད་ཉོན་མོངས་བདུད་ནི་བཅོམ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་གྲངས་ཀྱང་མེད་པ་འབྱུང་། །
en: “There will be a single congregation, Gathering innumerably many millions Of worthy ones who have all conquered the demon of defilement.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ཉིན་གཅིག་གནས་པར་འགྱུར། །
en: “And after this knower of the world has attained nirvāṇa His sacred Dharma will remain for one day.

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་སྐུ་གདུང་ནི། །མཆོད་རྟེན་དཔག་ཚད་བདུན་པ་གཅིག་ཅིག་འབྱུང་།། །།
en: When this victor has attained nirvāṇa His relics will be contained in a stūpa measuring seven leagues.

source: འཇིག་རྟེན་མགོན་པོ་སྐྱེས་མཆོག་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མཆོག་ཏུ་མཛེས་པ་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world, the supreme being Puṃgava, Will be born in a place called Supreme Beauty.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ལྗོན་ཤིང་དབང་པོ་ཡབ། །ང་རྒྱལ་ལྗོན་ཤིང་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Royal Tree will be his father, and Tree of Pride will be this victor’s mother.

source: སྲས་པོ་མཆོག་མ་ལེགས་མཆོག་རིམ་གྲོ་པ། །
en: Supreme will be his son and Supreme Excellence his attendant.

source: ཆོས་ཀྱི་མཆོག་མ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Dharma Supremacy will be the scholar

source: གསལ་བར་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Clear Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་དྲི་མ་སྤྲུགས་པ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་དགུ་དགུ་འབྱུང་བར་འགྱུར། །
en: “There will be twenty consecutive congregations, Each of them gathering nine billion Worthy ones who have brought the stains to exhaustion.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་སུམ་ཁྲི་ཡིན། །
en: The lifespan of humans will be thirty thousand years,

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །མཆོད་རྟེན་དཔག་ཚད་དྲུག་པ་འབྱུང་བར་འགྱུར། །
en: The single relic of this victor Will be contained in a stūpa six leagues large.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་སྡུག་སྐྱེ་བ་ཡི། །ཡུལ་ནི་བལྟ་ན་སྡུག་པ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Laḍitanetra Will be born in a place called Delightful to Behold.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་ཡབ་ནི་མཛེས་ལྡན་ཡིན། །མཛེས་དགའ་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend ninety-nine leagues. “Possessor of Beauty will be his father, and Beauty Joy will be this victor’s mother.

source: སྲས་པོ་མིག་བཟངས་མིག་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Eye will be his son and Endowed with Eyes his attendant.

source: མཛེས་པ་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Beautiful Light will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །བྱང་ཆུབ་མཆོག་རབ་དགའ་ལ་ལེགས་གནས་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering one trillion Who abide in the joy of supreme awakening.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this victor has attained nirvāṇa His sacred Dharma will remain for thirty thousand years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་བསྐོར་བར་འགྱུར། །
en: There will be a single stūpa dedicated to nirvāṇa Draped with nets of hundreds of jewels.

source: དེ་བཞིན་གཤེགས་པ་ཀླུས་ནི་བྱིན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཀླུ་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Nāgadatta Will be born in a place called Endowed with Nāgas.

source: ཡོངས་སུ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དག་ནི་སྟོང་དུ་གནས་པ་ཡིན། །
en: “And the sacred Dharma of the one who has attained parinirvāṇa Will remain for one thousand years.

source: དཔག་ཚད་བརྒྱད་པའི་མཆོད་རྟེན་འབྱུང་འགྱུར་ཏེ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: There will be a stūpa the size of eight leagues Draped with nets of hundreds of jewels.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པའི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གསལ་བའི་ཏོག་ཅེས་བྱ། །
en: “The thus-gone Satyaketu Will be born in a place called Crest of Clarity.

source: དེ་ཡི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one thousand leagues. “Excellent Crest will be his father, and Crest Banner will be this victor’s mother.

source: སྲས་པོ་སྒྲོན་མ་ལྷ་སྦྱིན་རིམ་གྲོ་པ། །
en: Lamp will be his son and Divine Gift his attendant.

source: འོད་མཆོག་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Light will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པ་ཀུན་ལ་ཆགས་བྲལ་ཡིད་ལྡན་པ། །དེ་དག་བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering one billion Whose minds are complete free from attachment to existence.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ལྔ་འབུམ་ཡིན། །
en: The lifespan of humans will be five hundred thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma will remain For ninety-eight thousand years for the benefit of beings.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ལྷ་མི་དག་གིས་རྟག་ཏུ་མཆོད་པར་འགྱུར། །
en: The relics of this victor will be abundant And remain the constant objects of worship for gods and humans.

source: འཇིག་རྟེན་མགོན་པོ་བརྒྱན་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གཟི་བརྗིད་ལེགས་པར་བརྒྱན་ཅེས་བྱ། །
en: “The protector of the world, Maṇḍita, Will be born in a place called Adorned with Excellent Splendor.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ཁྱད་པར་འཕགས། །བློ་བརྒྱན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend twenty-two leagues. “Distinguished will be his father, and Mind Adornment will be this victor’s mother.

source: གནམ་པོ་སྲས་ཡིན་དེས་པ་རིམ་གྲོ་པ། །
en: Honest will be his son and Gentle his attendant.

source: ལེགས་བསམས་སེམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Mind of Excellent Thought the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐ་བ་མེད་པའི་བསམ་གཏན་པ་དེ་དག །དུང་ཕྱུར་ཕྲག་ནི་བརྒྱད་བརྒྱད་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering eight hundred million Meditators free from rigidity.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བརྒྱད་ཅུ་ཡིན། །
en: The lifespan of humans will be eighty years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this victor has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་བླ་རེས་མཛེས་པར་བྱས། །
en: The single relic of this victor will be contained In a stūpa of four leagues covered by canopies.

source: དེ་བཞིན་གཤེགས་པ་ཞུམ་པ་མེད་དབྱངས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་དབྱངས་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Adīnaghoṣa Will be born in a place called Endowed with Melody.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་དབང་པོ་དབྱངས། །དབྱངས་སྙན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Melody Lord will be his father, and Beautiful Melody will be this victor’s mother.

source: སྲས་པོ་སྐད་སྙན་གདངས་མཆོག་རིམ་གྲོ་པ། །
en: Beautiful Voice will be his son and Supreme Tone his attendant.

source: བྱམས་པའི་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Song of Love will be the scholar

source: མཆོག་གི་དབྱངས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ཐོབ་པ་རིམས་ནད་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་བཅུ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering nine hundred million Who have become worthy ones and are free from the plagues.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-three thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་ཐམ་པར་གནས་པར་འགྱུར། །
en: “And after this victor has attained parinirvāṇa His sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་འབུམ་ཕྲག་སྙེད་ཀྱིས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And there will be hundreds of thousands of stūpas.

source: སངས་རྒྱས་རིན་ཆེན་འོད་ནི་སྐྱེ་བ་ཡི། །ཡུལ་ནི་བསོད་ནམས་གཟི་བརྗིད་བཟང་ཞེས་བྱ། །
en: “The buddha Ratnaprabha Will be born in a place called Excellent Splendor of Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་ལེགས་དགའ་ཡིན། །དུལ་གནས་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend two leagues. “Excellent Joy will be his father, and Joy in Abiding by the Training will be this victor’s mother.

source: སྲས་པོ་རྩི་སྨན་མཐུ་རྩལ་རིམ་གྲོ་པ། །
en: Medicine will be his son and Power his attendant.

source: སྲིད་པ་སེལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Dispeller of Existence will be the scholar

source: མེ་ཏོག་འོད་གསལ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Flower the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གསུམ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་རྣལ་འབྱོར་པ་དག་འདུས་འགྱུར་ཏེ། །བྱེ་བ་ཕྲག་ནི་བཅུ་གཉིས་བཅུ་གཉིས་ཡོད། །
en: “There will be thirteen consecutive congregations, Each of them gathering one hundred twenty million Worthy ones endowed with spiritual training.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་གསེར་གྱི་བླ་རེར་ལྡན། །
en: The relics of this victor will reside in a single stūpa Eight leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་བྱིན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དབྱངས་དག་དགའ་བ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone one Ghoṣadatta Will be born in a place called Melody Joy.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་དབྱངས་སྙན་ཡིན། །གདངས་སྙན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend ten leagues. “Beautiful Melody will be his father, and Beautiful Tone will be this victor’s mother.

source: སྲས་པོ་བདེན་ལྡན་ལྷ་ལེགས་རིམ་གྲོ་པ། །
en: Possessor of Truth will be his son and Divine Excellence his attendant.

source: ཡོན་ཏན་དབྱངས་དགའ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Joyous Melody of Excellent Qualities will be the one intelligence

source: ས་ཡི་དབྱངས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Melody of the Earth the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་དག་ལ་ཕན་བྱེད་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred thirty million Worthy ones who benefit the world.

source: དུལ་བ་དུལ་བར་མཛད་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this trainer Will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །ཀུན་ནས་དཔག་ཚད་གསུམ་པ་དག་ཏུ་འགྱུར། །
en: There will be a single stūpa with the relics of this victor, Measuring three leagues.

source: སེམས་ཅན་སྙིང་པོ་སེང་གེ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སེང་གེའི་སྒྲ་སྒྲོགས་པ་ཞེས་བྱ། །
en: “The heart of sentient beings, Siṃha, Will be born in a place called Roaring Lion.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་སེང་གེ་ཡིན། །རྒྱལ་ཡུམ་རི་དགས་མིག་ཡིན་དབང་ཕྱུག་དགའ། །སྲས་ཡིན་དྲག་ཤུལ་བྱིན་ནི་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Lion will be his father, and Deer Eye will be this victor’s mother. Master Joy will be his son and Fierce Gift his attendant.

source: ང་རོ་སྙན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Melodious Roar will be the scholar

source: ང་རོ་ཚངས་པའི་དབྱངས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Roar in the Brahmā Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྒྱལ་སྲས་ཆོས་འཛིན་པ་དག་འདུས་འགྱུར་ཏེ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འབྱུང་བར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one billion Dharma-holding sons of the victorious ones.
